name: "AUNet"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 8 dim: 3 dim: 176 dim: 176 } }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      
    }
  }
}

layer{
  name: "conv1_branch1_division"
  type: "Division"
  bottom: "conv1"
  top: "out1_branch1_1"
  top: "out1_branch1_2"
  top: "out1_branch1_3"
  top: "out1_branch1_4"
  top: "out1_branch1_5"
  top: "out1_branch1_6"
  top: "out1_branch1_7"
  top: "out1_branch1_8"
  top: "out1_branch1_9"
  top: "out1_branch1_10"
  top: "out1_branch1_11"
  top: "out1_branch1_12"
  top: "out1_branch1_13"
  top: "out1_branch1_14"
  top: "out1_branch1_15"
  top: "out1_branch1_16"
  top: "out1_branch1_17"
  top: "out1_branch1_18"
  top: "out1_branch1_19"
  top: "out1_branch1_20"
  top: "out1_branch1_21"
  top: "out1_branch1_22"
  top: "out1_branch1_23"
  top: "out1_branch1_24"
  top: "out1_branch1_25"
  top: "out1_branch1_26"
  top: "out1_branch1_27"
  top: "out1_branch1_28"
  top: "out1_branch1_29"
  top: "out1_branch1_30"
  top: "out1_branch1_31"
  top: "out1_branch1_32"
  top: "out1_branch1_33"
  top: "out1_branch1_34"
  top: "out1_branch1_35"
  top: "out1_branch1_36"
  top: "out1_branch1_37"
  top: "out1_branch1_38"
  top: "out1_branch1_39"
  top: "out1_branch1_40"
  top: "out1_branch1_41"
  top: "out1_branch1_42"
  top: "out1_branch1_43"
  top: "out1_branch1_44"
  top: "out1_branch1_45"
  top: "out1_branch1_46"
  top: "out1_branch1_47"
  top: "out1_branch1_48"
  top: "out1_branch1_49"
  top: "out1_branch1_50"
  top: "out1_branch1_51"
  top: "out1_branch1_52"
  top: "out1_branch1_53"
  top: "out1_branch1_54"
  top: "out1_branch1_55"
  top: "out1_branch1_56"
  top: "out1_branch1_57"
  top: "out1_branch1_58"
  top: "out1_branch1_59"
  top: "out1_branch1_60"
  top: "out1_branch1_61"
  top: "out1_branch1_62"
  top: "out1_branch1_63"
  top: "out1_branch1_64"
  division_param{
  width: 22
  height: 22

  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154
  
  
  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154


  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154


  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154
 

  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154

  
  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154
 

  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154

  xcoord: 0
  xcoord: 22
  xcoord: 44
  xcoord: 66
  xcoord: 88
  xcoord: 110
  xcoord: 132
  xcoord: 154
 


  ycoord: 0
  ycoord: 0
  ycoord: 0
  ycoord: 0
  ycoord: 0
  ycoord: 0
  ycoord: 0
  ycoord: 0

  ycoord: 22
  ycoord: 22
  ycoord: 22
  ycoord: 22
  ycoord: 22
  ycoord: 22
  ycoord: 22
  ycoord: 22

  ycoord: 44
  ycoord: 44
  ycoord: 44
  ycoord: 44
  ycoord: 44
  ycoord: 44
  ycoord: 44
  ycoord: 44

  ycoord: 66
  ycoord: 66
  ycoord: 66
  ycoord: 66
  ycoord: 66
  ycoord: 66
  ycoord: 66
  ycoord: 66

  ycoord: 88
  ycoord: 88
  ycoord: 88
  ycoord: 88
  ycoord: 88
  ycoord: 88
  ycoord: 88
  ycoord: 88

  ycoord: 110
  ycoord: 110
  ycoord: 110
  ycoord: 110
  ycoord: 110
  ycoord: 110
  ycoord: 110
  ycoord: 110

  ycoord: 132
  ycoord: 132
  ycoord: 132
  ycoord: 132
  ycoord: 132
  ycoord: 132
  ycoord: 132
  ycoord: 132

  ycoord: 154
  ycoord: 154
  ycoord: 154
  ycoord: 154
  ycoord: 154
  ycoord: 154
  ycoord: 154
  ycoord: 154
  }
}

layer {
  name: "out1_branch1_1_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_1"
  top: "out1_branch1_1"
}

layer {
  name: "out1_branch1_2_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_2"
  top: "out1_branch1_2"
}

layer {
  name: "out1_branch1_3_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_3"
  top: "out1_branch1_3"
}

layer {
  name: "out1_branch1_4_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_4"
  top: "out1_branch1_4"
}

layer {
  name: "out1_branch1_5_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_5"
  top: "out1_branch1_5"
}

layer {
  name: "out1_branch1_6_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_6"
  top: "out1_branch1_6"
}

layer {
  name: "out1_branch1_7_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_7"
  top: "out1_branch1_7"
}

layer {
  name: "out1_branch1_8_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_8"
  top: "out1_branch1_8"
}

layer {
  name: "out1_branch1_9_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_9"
  top: "out1_branch1_9"
}

layer {
  name: "out1_branch1_10_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_10"
  top: "out1_branch1_10"
}

layer {
  name: "out1_branch1_11_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_11"
  top: "out1_branch1_11"
}

layer {
  name: "out1_branch1_12_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_12"
  top: "out1_branch1_12"
}

layer {
  name: "out1_branch1_13_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_13"
  top: "out1_branch1_13"
}

layer {
  name: "out1_branch1_14_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_14"
  top: "out1_branch1_14"
}

layer {
  name: "out1_branch1_15_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_15"
  top: "out1_branch1_15"
}

layer {
  name: "out1_branch1_16_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_16"
  top: "out1_branch1_16"
}

layer {
  name: "out1_branch1_17_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_17"
  top: "out1_branch1_17"
}

layer {
  name: "out1_branch1_18_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_18"
  top: "out1_branch1_18"
}

layer {
  name: "out1_branch1_19_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_19"
  top: "out1_branch1_19"
}

layer {
  name: "out1_branch1_20_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_20"
  top: "out1_branch1_20"
}

layer {
  name: "out1_branch1_21_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_21"
  top: "out1_branch1_21"
}

layer {
  name: "out1_branch1_22_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_22"
  top: "out1_branch1_22"
}

layer {
  name: "out1_branch1_23_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_23"
  top: "out1_branch1_23"
}

layer {
  name: "out1_branch1_24_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_24"
  top: "out1_branch1_24"
}

layer {
  name: "out1_branch1_25_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_25"
  top: "out1_branch1_25"
}

layer {
  name: "out1_branch1_26_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_26"
  top: "out1_branch1_26"
}

layer {
  name: "out1_branch1_27_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_27"
  top: "out1_branch1_27"
}

layer {
  name: "out1_branch1_28_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_28"
  top: "out1_branch1_28"
}

layer {
  name: "out1_branch1_29_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_29"
  top: "out1_branch1_29"
}

layer {
  name: "out1_branch1_30_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_30"
  top: "out1_branch1_30"
}

layer {
  name: "out1_branch1_31_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_31"
  top: "out1_branch1_31"
}

layer {
  name: "out1_branch1_32_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_32"
  top: "out1_branch1_32"
}

layer {
  name: "out1_branch1_33_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_33"
  top: "out1_branch1_33"
}

layer {
  name: "out1_branch1_34_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_34"
  top: "out1_branch1_34"
}

layer {
  name: "out1_branch1_35_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_35"
  top: "out1_branch1_35"
}

layer {
  name: "out1_branch1_36_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_36"
  top: "out1_branch1_36"
}

layer {
  name: "out1_branch1_37_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_37"
  top: "out1_branch1_37"
}

layer {
  name: "out1_branch1_38_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_38"
  top: "out1_branch1_38"
}

layer {
  name: "out1_branch1_39_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_39"
  top: "out1_branch1_39"
}

layer {
  name: "out1_branch1_40_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_40"
  top: "out1_branch1_40"
}

layer {
  name: "out1_branch1_41_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_41"
  top: "out1_branch1_41"
}

layer {
  name: "out1_branch1_42_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_42"
  top: "out1_branch1_42"
}

layer {
  name: "out1_branch1_43_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_43"
  top: "out1_branch1_43"
}

layer {
  name: "out1_branch1_44_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_44"
  top: "out1_branch1_44"
}

layer {
  name: "out1_branch1_45_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_45"
  top: "out1_branch1_45"
}

layer {
  name: "out1_branch1_46_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_46"
  top: "out1_branch1_46"
}

layer {
  name: "out1_branch1_47_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_47"
  top: "out1_branch1_47"
}

layer {
  name: "out1_branch1_48_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_48"
  top: "out1_branch1_48"
}

layer {
  name: "out1_branch1_49_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_49"
  top: "out1_branch1_49"
}

layer {
  name: "out1_branch1_50_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_50"
  top: "out1_branch1_50"
}

layer {
  name: "out1_branch1_51_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_51"
  top: "out1_branch1_51"
}

layer {
  name: "out1_branch1_52_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_52"
  top: "out1_branch1_52"
}

layer {
  name: "out1_branch1_53_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_53"
  top: "out1_branch1_53"
}

layer {
  name: "out1_branch1_54_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_54"
  top: "out1_branch1_54"
}

layer {
  name: "out1_branch1_55_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_55"
  top: "out1_branch1_55"
}

layer {
  name: "out1_branch1_56_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_56"
  top: "out1_branch1_56"
}

layer {
  name: "out1_branch1_57_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_57"
  top: "out1_branch1_57"
}

layer {
  name: "out1_branch1_58_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_58"
  top: "out1_branch1_58"
}

layer {
  name: "out1_branch1_59_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_59"
  top: "out1_branch1_59"
}

layer {
  name: "out1_branch1_60_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_60"
  top: "out1_branch1_60"
}

layer {
  name: "out1_branch1_61_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_61"
  top: "out1_branch1_61"
}

layer {
  name: "out1_branch1_62_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_62"
  top: "out1_branch1_62"
}

layer {
  name: "out1_branch1_63_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_63"
  top: "out1_branch1_63"
}

layer {
  name: "out1_branch1_64_bn"
  type: "BatchNorm"
  bottom: "out1_branch1_64"
  top: "out1_branch1_64"
}

layer {
  name: "out1_branch1_1_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_1"
  top: "out1_branch1_1"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_2_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_2"
  top: "out1_branch1_2"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_3_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_3"
  top: "out1_branch1_3"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_4_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_4"
  top: "out1_branch1_4"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_5_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_5"
  top: "out1_branch1_5"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_6_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_6"
  top: "out1_branch1_6"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_7_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_7"
  top: "out1_branch1_7"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_8_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_8"
  top: "out1_branch1_8"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_9_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_9"
  top: "out1_branch1_9"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_10_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_10"
  top: "out1_branch1_10"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_11_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_11"
  top: "out1_branch1_11"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_12_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_12"
  top: "out1_branch1_12"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_13_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_13"
  top: "out1_branch1_13"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_14_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_14"
  top: "out1_branch1_14"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_15_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_15"
  top: "out1_branch1_15"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_16_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_16"
  top: "out1_branch1_16"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_17_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_17"
  top: "out1_branch1_17"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_18_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_18"
  top: "out1_branch1_18"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_19_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_19"
  top: "out1_branch1_19"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_20_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_20"
  top: "out1_branch1_20"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_21_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_21"
  top: "out1_branch1_21"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_22_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_22"
  top: "out1_branch1_22"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_23_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_23"
  top: "out1_branch1_23"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_24_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_24"
  top: "out1_branch1_24"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_25_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_25"
  top: "out1_branch1_25"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_26_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_26"
  top: "out1_branch1_26"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_27_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_27"
  top: "out1_branch1_27"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_28_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_28"
  top: "out1_branch1_28"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_29_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_29"
  top: "out1_branch1_29"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_30_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_30"
  top: "out1_branch1_30"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_31_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_31"
  top: "out1_branch1_31"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_32_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_32"
  top: "out1_branch1_32"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_33_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_33"
  top: "out1_branch1_33"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_34_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_34"
  top: "out1_branch1_34"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_35_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_35"
  top: "out1_branch1_35"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_36_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_36"
  top: "out1_branch1_36"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_37_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_37"
  top: "out1_branch1_37"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_38_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_38"
  top: "out1_branch1_38"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_39_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_39"
  top: "out1_branch1_39"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_40_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_40"
  top: "out1_branch1_40"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_41_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_41"
  top: "out1_branch1_41"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_42_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_42"
  top: "out1_branch1_42"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_43_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_43"
  top: "out1_branch1_43"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_44_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_44"
  top: "out1_branch1_44"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_45_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_45"
  top: "out1_branch1_45"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_46_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_46"
  top: "out1_branch1_46"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_47_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_47"
  top: "out1_branch1_47"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_48_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_48"
  top: "out1_branch1_48"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_49_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_49"
  top: "out1_branch1_49"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_50_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_50"
  top: "out1_branch1_50"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_51_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_51"
  top: "out1_branch1_51"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_52_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_52"
  top: "out1_branch1_52"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_53_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_53"
  top: "out1_branch1_53"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_54_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_54"
  top: "out1_branch1_54"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_55_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_55"
  top: "out1_branch1_55"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_56_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_56"
  top: "out1_branch1_56"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_57_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_57"
  top: "out1_branch1_57"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_58_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_58"
  top: "out1_branch1_58"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_59_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_59"
  top: "out1_branch1_59"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_60_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_60"
  top: "out1_branch1_60"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_61_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_61"
  top: "out1_branch1_61"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_62_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_62"
  top: "out1_branch1_62"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_63_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_63"
  top: "out1_branch1_63"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_64_bn_scale"
  type: "Scale"
  bottom: "out1_branch1_64"
  top: "out1_branch1_64"
  scale_param {
  	bias_term: true
  }
}

layer {
  name: "out1_branch1_1_relu"
  type: "ReLU"
  bottom: "out1_branch1_1"
  top: "out1_branch1_1"
}

layer {
  name: "out1_branch1_2_relu"
  type: "ReLU"
  bottom: "out1_branch1_2"
  top: "out1_branch1_2"
}

layer {
  name: "out1_branch1_3_relu"
  type: "ReLU"
  bottom: "out1_branch1_3"
  top: "out1_branch1_3"
}

layer {
  name: "out1_branch1_4_relu"
  type: "ReLU"
  bottom: "out1_branch1_4"
  top: "out1_branch1_4"
}

layer {
  name: "out1_branch1_5_relu"
  type: "ReLU"
  bottom: "out1_branch1_5"
  top: "out1_branch1_5"
}

layer {
  name: "out1_branch1_6_relu"
  type: "ReLU"
  bottom: "out1_branch1_6"
  top: "out1_branch1_6"
}

layer {
  name: "out1_branch1_7_relu"
  type: "ReLU"
  bottom: "out1_branch1_7"
  top: "out1_branch1_7"
}

layer {
  name: "out1_branch1_8_relu"
  type: "ReLU"
  bottom: "out1_branch1_8"
  top: "out1_branch1_8"
}

layer {
  name: "out1_branch1_9_relu"
  type: "ReLU"
  bottom: "out1_branch1_9"
  top: "out1_branch1_9"
}

layer {
  name: "out1_branch1_10_relu"
  type: "ReLU"
  bottom: "out1_branch1_10"
  top: "out1_branch1_10"
}

layer {
  name: "out1_branch1_11_relu"
  type: "ReLU"
  bottom: "out1_branch1_11"
  top: "out1_branch1_11"
}

layer {
  name: "out1_branch1_12_relu"
  type: "ReLU"
  bottom: "out1_branch1_12"
  top: "out1_branch1_12"
}

layer {
  name: "out1_branch1_13_relu"
  type: "ReLU"
  bottom: "out1_branch1_13"
  top: "out1_branch1_13"
}

layer {
  name: "out1_branch1_14_relu"
  type: "ReLU"
  bottom: "out1_branch1_14"
  top: "out1_branch1_14"
}

layer {
  name: "out1_branch1_15_relu"
  type: "ReLU"
  bottom: "out1_branch1_15"
  top: "out1_branch1_15"
}

layer {
  name: "out1_branch1_16_relu"
  type: "ReLU"
  bottom: "out1_branch1_16"
  top: "out1_branch1_16"
}

layer {
  name: "out1_branch1_17_relu"
  type: "ReLU"
  bottom: "out1_branch1_17"
  top: "out1_branch1_17"
}

layer {
  name: "out1_branch1_18_relu"
  type: "ReLU"
  bottom: "out1_branch1_18"
  top: "out1_branch1_18"
}

layer {
  name: "out1_branch1_19_relu"
  type: "ReLU"
  bottom: "out1_branch1_19"
  top: "out1_branch1_19"
}

layer {
  name: "out1_branch1_20_relu"
  type: "ReLU"
  bottom: "out1_branch1_20"
  top: "out1_branch1_20"
}

layer {
  name: "out1_branch1_21_relu"
  type: "ReLU"
  bottom: "out1_branch1_21"
  top: "out1_branch1_21"
}

layer {
  name: "out1_branch1_22_relu"
  type: "ReLU"
  bottom: "out1_branch1_22"
  top: "out1_branch1_22"
}

layer {
  name: "out1_branch1_23_relu"
  type: "ReLU"
  bottom: "out1_branch1_23"
  top: "out1_branch1_23"
}

layer {
  name: "out1_branch1_24_relu"
  type: "ReLU"
  bottom: "out1_branch1_24"
  top: "out1_branch1_24"
}

layer {
  name: "out1_branch1_25_relu"
  type: "ReLU"
  bottom: "out1_branch1_25"
  top: "out1_branch1_25"
}

layer {
  name: "out1_branch1_26_relu"
  type: "ReLU"
  bottom: "out1_branch1_26"
  top: "out1_branch1_26"
}

layer {
  name: "out1_branch1_27_relu"
  type: "ReLU"
  bottom: "out1_branch1_27"
  top: "out1_branch1_27"
}

layer {
  name: "out1_branch1_28_relu"
  type: "ReLU"
  bottom: "out1_branch1_28"
  top: "out1_branch1_28"
}

layer {
  name: "out1_branch1_29_relu"
  type: "ReLU"
  bottom: "out1_branch1_29"
  top: "out1_branch1_29"
}

layer {
  name: "out1_branch1_30_relu"
  type: "ReLU"
  bottom: "out1_branch1_30"
  top: "out1_branch1_30"
}

layer {
  name: "out1_branch1_31_relu"
  type: "ReLU"
  bottom: "out1_branch1_31"
  top: "out1_branch1_31"
}

layer {
  name: "out1_branch1_32_relu"
  type: "ReLU"
  bottom: "out1_branch1_32"
  top: "out1_branch1_32"
}

layer {
  name: "out1_branch1_33_relu"
  type: "ReLU"
  bottom: "out1_branch1_33"
  top: "out1_branch1_33"
}

layer {
  name: "out1_branch1_34_relu"
  type: "ReLU"
  bottom: "out1_branch1_34"
  top: "out1_branch1_34"
}

layer {
  name: "out1_branch1_35_relu"
  type: "ReLU"
  bottom: "out1_branch1_35"
  top: "out1_branch1_35"
}

layer {
  name: "out1_branch1_36_relu"
  type: "ReLU"
  bottom: "out1_branch1_36"
  top: "out1_branch1_36"
}

layer {
  name: "out1_branch1_37_relu"
  type: "ReLU"
  bottom: "out1_branch1_37"
  top: "out1_branch1_37"
}

layer {
  name: "out1_branch1_38_relu"
  type: "ReLU"
  bottom: "out1_branch1_38"
  top: "out1_branch1_38"
}

layer {
  name: "out1_branch1_39_relu"
  type: "ReLU"
  bottom: "out1_branch1_39"
  top: "out1_branch1_39"
}

layer {
  name: "out1_branch1_40_relu"
  type: "ReLU"
  bottom: "out1_branch1_40"
  top: "out1_branch1_40"
}

layer {
  name: "out1_branch1_41_relu"
  type: "ReLU"
  bottom: "out1_branch1_41"
  top: "out1_branch1_41"
}

layer {
  name: "out1_branch1_42_relu"
  type: "ReLU"
  bottom: "out1_branch1_42"
  top: "out1_branch1_42"
}

layer {
  name: "out1_branch1_43_relu"
  type: "ReLU"
  bottom: "out1_branch1_43"
  top: "out1_branch1_43"
}

layer {
  name: "out1_branch1_44_relu"
  type: "ReLU"
  bottom: "out1_branch1_44"
  top: "out1_branch1_44"
}

layer {
  name: "out1_branch1_45_relu"
  type: "ReLU"
  bottom: "out1_branch1_45"
  top: "out1_branch1_45"
}

layer {
  name: "out1_branch1_46_relu"
  type: "ReLU"
  bottom: "out1_branch1_46"
  top: "out1_branch1_46"
}

layer {
  name: "out1_branch1_47_relu"
  type: "ReLU"
  bottom: "out1_branch1_47"
  top: "out1_branch1_47"
}

layer {
  name: "out1_branch1_48_relu"
  type: "ReLU"
  bottom: "out1_branch1_48"
  top: "out1_branch1_48"
}

layer {
  name: "out1_branch1_49_relu"
  type: "ReLU"
  bottom: "out1_branch1_49"
  top: "out1_branch1_49"
}

layer {
  name: "out1_branch1_50_relu"
  type: "ReLU"
  bottom: "out1_branch1_50"
  top: "out1_branch1_50"
}

layer {
  name: "out1_branch1_51_relu"
  type: "ReLU"
  bottom: "out1_branch1_51"
  top: "out1_branch1_51"
}

layer {
  name: "out1_branch1_52_relu"
  type: "ReLU"
  bottom: "out1_branch1_52"
  top: "out1_branch1_52"
}

layer {
  name: "out1_branch1_53_relu"
  type: "ReLU"
  bottom: "out1_branch1_53"
  top: "out1_branch1_53"
}

layer {
  name: "out1_branch1_54_relu"
  type: "ReLU"
  bottom: "out1_branch1_54"
  top: "out1_branch1_54"
}

layer {
  name: "out1_branch1_55_relu"
  type: "ReLU"
  bottom: "out1_branch1_55"
  top: "out1_branch1_55"
}

layer {
  name: "out1_branch1_56_relu"
  type: "ReLU"
  bottom: "out1_branch1_56"
  top: "out1_branch1_56"
}

layer {
  name: "out1_branch1_57_relu"
  type: "ReLU"
  bottom: "out1_branch1_57"
  top: "out1_branch1_57"
}

layer {
  name: "out1_branch1_58_relu"
  type: "ReLU"
  bottom: "out1_branch1_58"
  top: "out1_branch1_58"
}

layer {
  name: "out1_branch1_59_relu"
  type: "ReLU"
  bottom: "out1_branch1_59"
  top: "out1_branch1_59"
}

layer {
  name: "out1_branch1_60_relu"
  type: "ReLU"
  bottom: "out1_branch1_60"
  top: "out1_branch1_60"
}

layer {
  name: "out1_branch1_61_relu"
  type: "ReLU"
  bottom: "out1_branch1_61"
  top: "out1_branch1_61"
}

layer {
  name: "out1_branch1_62_relu"
  type: "ReLU"
  bottom: "out1_branch1_62"
  top: "out1_branch1_62"
}

layer {
  name: "out1_branch1_63_relu"
  type: "ReLU"
  bottom: "out1_branch1_63"
  top: "out1_branch1_63"
}

layer {
  name: "out1_branch1_64_relu"
  type: "ReLU"
  bottom: "out1_branch1_64"
  top: "out1_branch1_64"
}


layer {
  name: "res1_branch1_1"
  type: "Convolution"
  bottom: "out1_branch1_1"
  top: "res1_branch1_1"
	  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_2"
  type: "Convolution"
  bottom: "out1_branch1_2"
  top: "res1_branch1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_3"
  type: "Convolution"
  bottom: "out1_branch1_3"
  top: "res1_branch1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_4"
  type: "Convolution"
  bottom: "out1_branch1_4"
  top: "res1_branch1_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_5"
  type: "Convolution"
  bottom: "out1_branch1_5"
  top: "res1_branch1_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_6"
  type: "Convolution"
  bottom: "out1_branch1_6"
  top: "res1_branch1_6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_7"
  type: "Convolution"
  bottom: "out1_branch1_7"
  top: "res1_branch1_7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_8"
  type: "Convolution"
  bottom: "out1_branch1_8"
  top: "res1_branch1_8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_9"
  type: "Convolution"
  bottom: "out1_branch1_9"
  top: "res1_branch1_9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_10"
  type: "Convolution"
  bottom: "out1_branch1_10"
  top: "res1_branch1_10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_11"
  type: "Convolution"
  bottom: "out1_branch1_11"
  top: "res1_branch1_11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_12"
  type: "Convolution"
  bottom: "out1_branch1_12"
  top: "res1_branch1_12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_13"
  type: "Convolution"
  bottom: "out1_branch1_13"
  top: "res1_branch1_13"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_14"
  type: "Convolution"
  bottom: "out1_branch1_14"
  top: "res1_branch1_14"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_15"
  type: "Convolution"
  bottom: "out1_branch1_15"
  top: "res1_branch1_15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_16"
  type: "Convolution"
  bottom: "out1_branch1_16"
  top: "res1_branch1_16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_17"
  type: "Convolution"
  bottom: "out1_branch1_17"
  top: "res1_branch1_17"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_18"
  type: "Convolution"
  bottom: "out1_branch1_18"
  top: "res1_branch1_18"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_19"
  type: "Convolution"
  bottom: "out1_branch1_19"
  top: "res1_branch1_19"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_20"
  type: "Convolution"
  bottom: "out1_branch1_20"
  top: "res1_branch1_20"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_21"
  type: "Convolution"
  bottom: "out1_branch1_21"
  top: "res1_branch1_21"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_22"
  type: "Convolution"
  bottom: "out1_branch1_22"
  top: "res1_branch1_22"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_23"
  type: "Convolution"
  bottom: "out1_branch1_23"
  top: "res1_branch1_23"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_24"
  type: "Convolution"
  bottom: "out1_branch1_24"
  top: "res1_branch1_24"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_25"
  type: "Convolution"
  bottom: "out1_branch1_25"
  top: "res1_branch1_25"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_26"
  type: "Convolution"
  bottom: "out1_branch1_26"
  top: "res1_branch1_26"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_27"
  type: "Convolution"
  bottom: "out1_branch1_27"
  top: "res1_branch1_27"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_28"
  type: "Convolution"
  bottom: "out1_branch1_28"
  top: "res1_branch1_28"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_29"
  type: "Convolution"
  bottom: "out1_branch1_29"
  top: "res1_branch1_29"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_30"
  type: "Convolution"
  bottom: "out1_branch1_30"
  top: "res1_branch1_30"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_31"
  type: "Convolution"
  bottom: "out1_branch1_31"
  top: "res1_branch1_31"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_32"
  type: "Convolution"
  bottom: "out1_branch1_32"
  top: "res1_branch1_32"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_33"
  type: "Convolution"
  bottom: "out1_branch1_33"
  top: "res1_branch1_33"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_34"
  type: "Convolution"
  bottom: "out1_branch1_34"
  top: "res1_branch1_34"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_35"
  type: "Convolution"
  bottom: "out1_branch1_35"
  top: "res1_branch1_35"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_36"
  type: "Convolution"
  bottom: "out1_branch1_36"
  top: "res1_branch1_36"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_37"
  type: "Convolution"
  bottom: "out1_branch1_37"
  top: "res1_branch1_37"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_38"
  type: "Convolution"
  bottom: "out1_branch1_38"
  top: "res1_branch1_38"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_39"
  type: "Convolution"
  bottom: "out1_branch1_39"
  top: "res1_branch1_39"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_40"
  type: "Convolution"
  bottom: "out1_branch1_40"
  top: "res1_branch1_40"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_41"
  type: "Convolution"
  bottom: "out1_branch1_41"
  top: "res1_branch1_41"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_42"
  type: "Convolution"
  bottom: "out1_branch1_42"
  top: "res1_branch1_42"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_43"
  type: "Convolution"
  bottom: "out1_branch1_43"
  top: "res1_branch1_43"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_44"
  type: "Convolution"
  bottom: "out1_branch1_44"
  top: "res1_branch1_44"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_45"
  type: "Convolution"
  bottom: "out1_branch1_45"
  top: "res1_branch1_45"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_46"
  type: "Convolution"
  bottom: "out1_branch1_46"
  top: "res1_branch1_46"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "res1_branch1_47"
  type: "Convolution"
  bottom: "out1_branch1_47"
  top: "res1_branch1_47"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
